// ----1----
// Створіть функцію-конструктор Calculator, який створює об’єкти з трьома
// методами:
// read() запитує два значення за допомогою prompt і запам’ятовує їх у
// властивостях об’єкта.
// sum() повертає суму цих властивостей.
// mul() повертає результат множення даних властивостей.

// function Calculator(num1, num2) {

//     this.num1 = num1;
//     this.num2 = num2;

//     function read(){
//          num1 = prompt("Введіть число");
//          num2 = prompt("Введіть число");
//     };

//     function sum(){
//         alert(num1 + num2);
//     };
    
//     function mul() {
//         alert(num1 * num2);
//     };
// }





